xhawk18/s_task/build_stm32f302/Libraries/STM32F30x_I2C_CPAL_Driver/inc/stm32f30x_i2c_cpal_hal.h
/**
  ******************************************************************************
  * @file    stm32f30x_i2c_cpal_hal.h
  * @author  MCD Application Team
  * @version V1.2.1
  * @date    31-October-2014
  * @brief   This file contains all the functions prototypes for the CPAL_I2C_HAL
  *          firmware layer.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2014 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software
  * distributed under the License is distributed on an "AS IS" BASIS,
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef ___STM32F30X_I2C_CPAL_HAL_H
#define ___STM32F30X_I2C_CPAL_HAL_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
/*========= STM32 Standard library files includes =========*/
#include "stm32f30x.h"
#include "stm32f30x_i2c.h"
#include "stm32f30x_dma.h"
#include "stm32f30x_gpio.h"
#include "stm32f30x_rcc.h"
#include "stm32f30x_misc.h"

/*========= CPAL library files includes =========*/
#include "stm32f30x_i2c_cpal.h"

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/*==== This defines are used to enable supported I2Cx by selected product ====*/
#ifdef STM32F303xC
 #define CPAL_I2C1_SUPPORTED
 #define CPAL_I2C2_SUPPORTED
 #define CPAL_I2C_DEV_NUM     2
#elif defined STM32F334x8
 #define CPAL_I2C1_SUPPORTED
 #define CPAL_I2C_DEV_NUM     1
#elif defined STM32F302x8 || STM32F303xE
 #define CPAL_I2C1_SUPPORTED
 #define CPAL_I2C2_SUPPORTED
 #define CPAL_I2C3_SUPPORTED
 #define CPAL_I2C_DEV_NUM     3
#else
 #error "Please select first the target STM32F30X device used in your application (in stm32f30x.h file)"
#endif

/*======================================================================================================================================
                                                 CPAL Hardware Configuration
========================================================================================================================================*/

/*  ------ Configure the communication device and all related peripherals ( GPIO Pin, DMA Channels,
            NVIC Priority) with this file, by referring to configuration Sections:

                - Section 1 : Select the pins to be used for each device instance.

                - Section 2 : Select TX and RX DMA Channels (if DMA mode will be used).

                - Section 3 : Set device's Events, Errors and DMA Interrupts Priorities.                   */


/*-----------------------------------------------------------------------------------------------------------------------*/
/*-----------------------------------------------------------------------------------------------------------------------*/

/*    -- Section 1 :                 **** Device IO Pins Selection ****

  Description: This section allows user to choose IO Pins for each device if possible (in accordance with
               used product: some products have only one possibility for the IO pins).
               Each device instance (I2C1, I2C2 ..) has its specific defines: one for each Pin.
               For each device instance, you will change existing defines with adequate IO Pins and Port
               ( Refer to Product Pin mapping in related datasheet).*/

/* To configure SCL and SDA Pin change these defines with adequate value :

#define CPAL_I2C1_SCL_GPIO_PORT         GPIOX                  (X : Name of the GPIO PORT  (A,B,C,....))
#define CPAL_I2C1_SCL_GPIO_CLK          RCC_APB2Periph_GPIOX   (X : Name of the GPIO PORT  (A,B,C,....))
#define CPAL_I2C1_SCL_GPIO_PIN          GPIO_Pin_X             (X : Pin number (1,2,3,....))
#define CPAL_I2C1_SCL_GPIO_PINSOURCE    GPIO_PinSourceX        (X : Pin number (1,2,3,....))

#define CPAL_I2C1_SDA_GPIO_PORT         GPIOX                  (X : Name of the GPIO PORT  (A,B,C,....))
#define CPAL_I2C1_SDA_GPIO_CLK          RCC_APB2Periph_GPIOX   (X : Name of the GPIO PORT  (A,B,C,....))
#define CPAL_I2C1_SDA_GPIO_PIN          GPIO_Pin_X             (X : Pin number (1,2,3,....))
#define CPAL_I2C1_SDA_GPIO_PINSOURCE    GPIO_PinSourceX        (X : Pin number (1,2,3,....))                   */

/* IO Pins selection possibilities

|--------|---------|--------------|-----------|------------------|-------------------------|-----------|
| Device | I2C PIN |   GPIO_PIN   | GPIO_PORT |  GPIO_PinSource  |        GPIO_CLK         |  GPIO_AF  |
|--------|---------|--------------|-----------|------------------|-------------------------|-----------|
|        |         |  GPIO_Pin_6  |   GPIOB   | GPIO_PinSource6  |   RCC_AHBPeriph_GPIOB   | GPIO_AF_4 |
|        |         |--------------|-----------|------------------|-------------------------|-----------|
|        |   SCL   |  GPIO_Pin_8  |   GPIOB   | GPIO_PinSource8  |   RCC_AHBPeriph_GPIOB   | GPIO_AF_4 |
|        |         |--------------|-----------|------------------|-------------------------|-----------|
|        |         |  GPIO_Pin_15 |   GPIOA   | GPIO_PinSource15 |   RCC_AHBPeriph_GPIOA   | GPIO_AF_4 |
|  I2C1  |---------|--------------|-----------|------------------|-------------------------|-----------|
|        |         |  GPIO_Pin_7  |   GPIOB   | GPIO_PinSource7  |   RCC_AHBPeriph_GPIOB   | GPIO_AF_4 |
|        |         |--------------|-----------|------------------|-------------------------|-----------|
|        |   SDA   |  GPIO_Pin_9  |   GPIOB   | GPIO_PinSource9  |   RCC_AHBPeriph_GPIOB   | GPIO_AF_4 |
         |         |--------------|-----------|------------------|-------------------------|-----------|
|        |         |  GPIO_Pin_14 |   GPIOA   | GPIO_PinSource14 |   RCC_AHBPeriph_GPIOA   | GPIO_AF_4 |
|--------|---------|--------------|-----------|------------------|-------------------------|-----------|
|        |         |  GPIO_Pin_1  |   GPIOF   | GPIO_PinSource1  |   RCC_AHBPeriph_GPIOF   | GPIO_AF_4 |
|        |   SCL   |--------------|-----------|------------------|-------------------------|-----------|
|        |         |  GPIO_Pin_6  |   GPIOF   | GPIO_PinSource6  |   RCC_AHBPeriph_GPIOF   | GPIO_AF_4 |
|        |         |--------------|-----------|------------------|-------------------------|-----------|
|        |         |  GPIO_Pin_9  |   GPIOA   | GPIO_PinSource9  |   RCC_AHBPeriph_GPIOA   | GPIO_AF_4 |
|  I2C2  |---------|--------------|-----------|------------------|-------------------------|-----------|
|        |         |  GPIO_Pin_0  |   GPIOF   | GPIO_PinSource0  |   RCC_AHBPeriph_GPIOF   | GPIO_AF_4 |
|        |   SDA   |--------------|-----------|------------------|-------------------------|-----------|
|        |         |  GPIO_Pin_10 |   GPIOA   | GPIO_PinSource10 |   RCC_AHBPeriph_GPIOA   | GPIO_AF_4 |
|--------|---------|--------------|-----------|------------------|-------------------------|-----------|
|        |   SCL   |  GPIO_Pin_8  |   GPIOA   | GPIO_PinSource8  |   RCC_AHBPeriph_GPIOA   | GPIO_AF_3 |
|  I2C3  |---------|--------------|-----------|------------------|-------------------------|-----------|
|        |         |  GPIO_Pin_9  |   GPIOC   | GPIO_PinSource9  |   RCC_AHBPeriph_GPIOC   | GPIO_AF_3 |
|        |   SDA   |--------------|-----------|------------------|-------------------------|-----------|
|        |         |  GPIO_Pin_5  |   GPIOB   | GPIO_PinSource5  |   RCC_AHBPeriph_GPIOB   | GPIO_AF_8 |
|--------|---------|--------------|-----------|------------------|-------------------------|-----------|
*/


/*----------- I2C1 Device -----------*/
#ifdef CPAL_I2C1_SUPPORTED
  #define CPAL_I2C1_SCL_GPIO_PORT         GPIOB
  #define CPAL_I2C1_SCL_GPIO_CLK          RCC_AHBPeriph_GPIOB
  #define CPAL_I2C1_SCL_GPIO_PIN          GPIO_Pin_6
  #define CPAL_I2C1_SCL_GPIO_PINSOURCE    GPIO_PinSource6
  #define CPAL_I2C1_SCL_GPIO_AF           GPIO_AF_4

  #define CPAL_I2C1_SDA_GPIO_PORT         GPIOB
  #define CPAL_I2C1_SDA_GPIO_CLK          RCC_AHBPeriph_GPIOB
  #define CPAL_I2C1_SDA_GPIO_PIN          GPIO_Pin_7
  #define CPAL_I2C1_SDA_GPIO_PINSOURCE    GPIO_PinSource7
  #define CPAL_I2C1_SDA_GPIO_AF           GPIO_AF_4
#endif /* CPAL_I2C1_SUPPORTED */

/*-----------I2C2 Device -----------*/
#ifdef CPAL_I2C2_SUPPORTED
  #define CPAL_I2C2_SCL_GPIO_PORT         GPIOF
  #define CPAL_I2C2_SCL_GPIO_CLK          RCC_AHBPeriph_GPIOF
  #define CPAL_I2C2_SCL_GPIO_PIN          GPIO_Pin_6
  #define CPAL_I2C2_SCL_GPIO_PINSOURCE    GPIO_PinSource6
  #define CPAL_I2C2_SCL_GPIO_AF           GPIO_AF_4

  #define CPAL_I2C2_SDA_GPIO_PORT         GPIOA
  #define CPAL_I2C2_SDA_GPIO_CLK          RCC_AHBPeriph_GPIOA
  #define CPAL_I2C2_SDA_GPIO_PIN          GPIO_Pin_10
  #define CPAL_I2C2_SDA_GPIO_PINSOURCE    GPIO_PinSource10
  #define CPAL_I2C2_SDA_GPIO_AF           GPIO_AF_4
#endif /* CPAL_I2C2_SUPPORTED */

/*-----------I2C3 Device -----------*/
#ifdef CPAL_I2C3_SUPPORTED
  #define CPAL_I2C3_SCL_GPIO_PORT         GPIOA
  #define CPAL_I2C3_SCL_GPIO_CLK          RCC_AHBPeriph_GPIOA
  #define CPAL_I2C3_SCL_GPIO_PIN          GPIO_Pin_8
  #define CPAL_I2C3_SCL_GPIO_PINSOURCE    GPIO_PinSource8
  #define CPAL_I2C3_SCL_GPIO_AF           GPIO_AF_3

  #define CPAL_I2C3_SDA_GPIO_PORT         GPIOC
  #define CPAL_I2C3_SDA_GPIO_CLK          RCC_AHBPeriph_GPIOC
  #define CPAL_I2C3_SDA_GPIO_PIN          GPIO_Pin_9
  #define CPAL_I2C3_SDA_GPIO_PINSOURCE    GPIO_PinSource9
  #define CPAL_I2C3_SDA_GPIO_AF           GPIO_AF_3
#endif /* CPAL_I2C3_SUPPORTED */

/*-----------------------------------------------------------------------------------------------------------------------*/
/*-----------------------------------------------------------------------------------------------------------------------*/

/*    -- Section 2 :           **** Device TX and RX DMA Channels Selection ****

  Description: This section allows user to choose TX and RX DMA Channels if possible (in accordance with
               used product) for each device.
               Each device instance (I2C1, I2C2 ..) has its specific defines: one for DMA TX Channel and
               another one for DMA RX Channel.
               For each device instance, you find all TX an RX DMA Channel possibilities ( Refer to Product
               Reference Manual).*/

