xhawk18/s_task/build_stm32f302/Libraries/STM32F30x_I2C_CPAL_Driver/inc/stm32f30x_i2c_cpal_hal.h
/*========= Common Defines =========*/

/* This define is used to enable DMA Channel */
#define CPAL_DMA_CCR_EN                 DMA_CCR_EN

/* This define is used to check I2C errors (BERR, ARLO and OVR) */
#define CPAL_I2C_STATUS_ERR_MASK        ((uint32_t)0x00000700)  /*!< I2C errors Mask  */

/* This define is used to check I2C events (TXIS, RXNE, ADDR, NACKF, STOPF, TC and TCR) */
#define CPAL_I2C_STATUS_EVT_MASK        ((uint16_t)0x0000000FE)  /*!< I2C event Mask for Status Register 1 */

 /* I2C Event Defines */
#define CPAL_I2C_EVT_ADDR               I2C_ISR_ADDR     /*!<Address matched */
#define CPAL_I2C_EVT_STOP               I2C_ISR_STOPF    /*!<Stop detection */
#define CPAL_I2C_EVT_NACK               I2C_ISR_NACKF    /*!<NACK received */
#define CPAL_I2C_EVT_RXNE               I2C_ISR_RXNE     /*!<Receive Data Register not Empty */
#define CPAL_I2C_EVT_TXIS               I2C_ISR_TXIS     /*!<Transmit interrupt Status */
#define CPAL_I2C_EVT_TCR                I2C_ISR_TCR      /*!<Transfer Complete Reload */
#define CPAL_I2C_EVT_TC                 I2C_ISR_TC       /*!<Transfer Complete */

/*========= I2C1 specific defines (GPIO, PINs, Clocks and DMA) =========*/
#ifdef CPAL_I2C1_SUPPORTED
  #define CPAL_I2C1_CLK                   RCC_APB1Periph_I2C1
  #define CPAL_I2C1_TXDR                  ((uint32_t)0x40005428)
  #define CPAL_I2C1_RXDR                  ((uint32_t)0x40005424)

  #define CPAL_I2C1_DMA                   DMA1
  #define CPAL_I2C1_DMA_CLK               RCC_AHBPeriph_DMA1

  #define CPAL_I2C1_IT_EVT_IRQn           I2C1_EV_IRQn
  #define CPAL_I2C1_IT_ERR_IRQn           I2C1_ER_IRQn

  #define CPAL_I2C1_DMA_TX_IRQn           DMA1_Channel6_IRQn
  #define CPAL_I2C1_DMA_RX_IRQn           DMA1_Channel7_IRQn

  #define CPAL_I2C1_DMA_TX_IRQHandler     DMA1_Channel6_IRQHandler
  #define CPAL_I2C1_DMA_RX_IRQHandler     DMA1_Channel7_IRQHandler

  #define CPAL_I2C1_DMA_TX_TC_FLAG        DMA1_FLAG_TC6
  #define CPAL_I2C1_DMA_TX_HT_FLAG        DMA1_FLAG_HT6
  #define CPAL_I2C1_DMA_TX_TE_FLAG        DMA1_FLAG_TE6

  #define CPAL_I2C1_DMA_RX_TC_FLAG        DMA1_FLAG_TC7
  #define CPAL_I2C1_DMA_RX_HT_FLAG        DMA1_FLAG_HT7
  #define CPAL_I2C1_DMA_RX_TE_FLAG        DMA1_FLAG_TE7
#endif /* CPAL_I2C1_SUPPORTED */

/*========= I2C2 specific defines (GPIO, PINs, Clocks and DMA) =========*/
#ifdef CPAL_I2C2_SUPPORTED
  #define CPAL_I2C2_CLK                   RCC_APB1Periph_I2C2
  #define CPAL_I2C2_TXDR                  ((uint32_t)0x40005828)
  #define CPAL_I2C2_RXDR                  ((uint32_t)0x40005824)

  #define CPAL_I2C2_DMA                   DMA1
  #define CPAL_I2C2_DMA_CLK               RCC_AHBPeriph_DMA1

  #define CPAL_I2C2_IT_EVT_IRQn           I2C2_EV_IRQn
  #define CPAL_I2C2_IT_ERR_IRQn           I2C2_ER_IRQn
  #define CPAL_I2C2_DMA_TX_IRQn           DMA1_Channel4_IRQn
  #define CPAL_I2C2_DMA_RX_IRQn           DMA1_Channel5_IRQn

  #define CPAL_I2C2_DMA_TX_IRQHandler     DMA1_Channel4_IRQHandler
  #define CPAL_I2C2_DMA_RX_IRQHandler     DMA1_Channel5_IRQHandler

  #define CPAL_I2C2_DMA_TX_TC_FLAG        DMA1_FLAG_TC4
  #define CPAL_I2C2_DMA_TX_HT_FLAG        DMA1_FLAG_HT4
  #define CPAL_I2C2_DMA_TX_TE_FLAG        DMA1_FLAG_TE4

  #define CPAL_I2C2_DMA_RX_TC_FLAG        DMA1_FLAG_TC5
  #define CPAL_I2C2_DMA_RX_HT_FLAG        DMA1_FLAG_HT5
  #define CPAL_I2C2_DMA_RX_TE_FLAG        DMA1_FLAG_TE5
#endif /* CPAL_I2C2_SUPPORTED */

/*========= I2C3 specific defines (GPIO, PINs, Clocks and DMA) =========*/
#ifdef CPAL_I2C3_SUPPORTED
  #define CPAL_I2C3_CLK                   RCC_APB1Periph_I2C3
  #define CPAL_I2C3_TXDR                  ((uint32_t)0x40007828)
  #define CPAL_I2C3_RXDR                  ((uint32_t)0x40007824)

  #define CPAL_I2C3_DMA                   DMA1
  #define CPAL_I2C3_DMA_CLK               RCC_AHBPeriph_DMA1

  #define CPAL_I2C3_IT_EVT_IRQn           I2C3_EV_IRQn
  #define CPAL_I2C3_IT_ERR_IRQn           I2C3_ER_IRQn
  #define CPAL_I2C3_DMA_TX_IRQn           DMA1_Channel1_IRQn
  #define CPAL_I2C3_DMA_RX_IRQn           DMA1_Channel2_IRQn

  #define CPAL_I2C3_DMA_TX_IRQHandler     DMA1_Channel1_IRQHandler
  #define CPAL_I2C3_DMA_RX_IRQHandler     DMA1_Channel2_IRQHandler

  #define CPAL_I2C3_DMA_TX_TC_FLAG        DMA1_FLAG_TC1
  #define CPAL_I2C3_DMA_TX_HT_FLAG        DMA1_FLAG_HT1
  #define CPAL_I2C3_DMA_TX_TE_FLAG        DMA1_FLAG_TE1

  #define CPAL_I2C3_DMA_RX_TC_FLAG        DMA1_FLAG_TC2
  #define CPAL_I2C3_DMA_RX_HT_FLAG        DMA1_FLAG_HT2
  #define CPAL_I2C3_DMA_RX_TE_FLAG        DMA1_FLAG_TE2
#endif /* CPAL_I2C3_SUPPORTED */

/* Exported macro ------------------------------------------------------------*/

/*========= Peripheral Clock Command =========*/

#define __I2C_CLK_CMD(clk,cmd)                          RCC_APB1PeriphClockCmd((clk),(cmd))

#define __I2C_RCC_RESET(clk)                            RCC_APB1PeriphResetCmd((clk),ENABLE);\
                                                        RCC_APB1PeriphResetCmd((clk),DISABLE)

#define __I2C_GPIO_CLK_CMD(clk,cmd)                     RCC_AHBPeriphClockCmd((clk),(cmd))

#define __DMA_CLK_CMD(clk,cmd)                          RCC_AHBPeriphClockCmd((clk),(cmd))

#define __DMA_RESET_CMD(clk,cmd)                        RCC_AHBPeriphResetCmd((clk),(cmd))


/*========= DMA =========*/

/* DMA channels enable/disable */

#define __CPAL_I2C_HAL_ENABLE_DMATX(device)             CPAL_I2C_DMA_TX_Channel[(device)]->CCR |= CPAL_DMA_CCR_EN

#define __CPAL_I2C_HAL_DISABLE_DMATX(device)            CPAL_I2C_DMA_TX_Channel[(device)]->CCR &= ~CPAL_DMA_CCR_EN

#define __CPAL_I2C_HAL_ENABLE_DMARX(device)             CPAL_I2C_DMA_RX_Channel[(device)]->CCR |= CPAL_DMA_CCR_EN

#define __CPAL_I2C_HAL_DISABLE_DMARX(device)            CPAL_I2C_DMA_RX_Channel[(device)]->CCR &= ~CPAL_DMA_CCR_EN

/* DMA interrupts enable/disable */

#define __I2C_HAL_ENABLE_DMATX_TCIT(device)             CPAL_I2C_DMA_TX_Channel[(device)]->CCR |= DMA_IT_TC

